test/multiphase/multiphaseEulerFoam/interfaceComposition/waterAndIsopropanolEvaporation/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    interfaceCompositionPhaseChangeMultiphaseSystem;

phases (gas liquid);

nInterfaceCorrectors 1;

gas
{
    type            multiComponentPhaseModel;
    diameterModel   none;
    residualAlpha   1e-6;
    Sct             0.7;
}

liquid
{
    type            multiComponentPhaseModel;
    diameterModel   constant;
    d               5e-4;
    residualAlpha   1e-6;
    Sct             1;
}

blending
{
    default
    {
        type            continuous;
        phase           gas;
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.07;
    }
}

drag
{}

virtualMass
{}

interfaceComposition
{
    gas_liquid_inThe_gas
    {
        type nonRandomTwoLiquid;
        species (H2O C3H8O);
        Le 1.0;
        H2O
        {
             alpha 0.3;
             beta 0.0;
             interaction
             {
                 type Antoine;
                 A 6.8284;
                 B -1283.46;
                 C 0;
             }
             type saturated;
             species (H2O);
             Le 1.0;
             saturationPressure
             {
                 type ArdenBuck;
             }
        }
        C3H8O
        {
             alpha 0.3;
             beta 0.0;
             interaction
             {
                 type Antoine;
                 A -1.3115;
                 B 426.398;
                 C 0;
             }
             type saturated;
             species (C3H8O);
             Le 1.0;
             saturationPressure
             {
                 type Antoine;
                 A 22.7057916;
                 B -3125.59117503;
                 C -75.814;
             }
        }
    }
}

heatTransfer
{
    liquid_dispersedIn_gas_inThe_gas
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }

    liquid_dispersedIn_gas_inThe_liquid
    {
        type spherical;
        residualAlpha 1e-4;
    }
}

diffusiveMassTransfer
{
    liquid_dispersedIn_gas_inThe_gas
    {
        type Frossling;
        Le 1.0;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
